_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 65, 318, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 17, 80, 16)        3088      
_________________________________________________________________
elu_1 (ELU)                  (None, 17, 80, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 9, 40, 32)         12832     
_________________________________________________________________
elu_2 (ELU)                  (None, 9, 40, 32)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 20, 64)         51264     
_________________________________________________________________
flatten_1 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 6400)              0         
_________________________________________________________________
elu_3 (ELU)                  (None, 6400)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               3277312   
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
elu_4 (ELU)                  (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 513       
=================================================================
Total params: 3,345,009.0
Trainable params: 3,345,009.0
Non-trainable params: 0.0
_________________________________________________________________
None
